SET NAMES UTF8;
DROP DATABASE IF EXISTS teacher;
CREATE DATABASE teacher CHARSET=UTF8;
USE teacher;
CREATE TABLE workers(
	wid INT PRIMARY KEY AUTO_INCREMENT,
	wname VARCHAR(64),
	gender VARCHAR(64),
	pic VARCHAR(256),
	birth BIGINT,
	graduate VARCHAR(128),
	departId INT
);
INSERT INTO workers VALUE
	(NULL,'姚贝娜','女','img/1.jpg','1234567891234','长治学院','20'),
	(NULL,'田亮','男','img/2.jpg','1234567891234','太原理工','10'),
	(NULL,'田震','女','img/3.jpg','1234567891234','山西大学','50'),
	(NULL,'汪涵','男','img/4.jpg','1234567891234','北京大学','30'),
	(NULL,'谢娜','女','img/5.jpg','1234567891234','烟台大学','50'),

	(NULL,'谢霆锋','男','img/6.jpg','1234567891234','长治医学院','10'),
	(NULL,'姚笛','女','img/7.jpg','1234567891234','运城学院','40'),
	(NULL,'林心如','女','img/8.jpg','1234567891234','上海交通大学','10'),
	(NULL,'黄晓明','男','img/9.jpg','1234567891234','北京邮电大学','30'),
	(NULL,'赵薇','女','img/10.jpg','1234567891234','上海戏剧学院','20'),

	(NULL,'范冰冰','女','img/11.jpg','1234567891234','四川大学','40'),
	(NULL,'李宇春','女','img/12.jpg','1234567891234','浙江大学','10'),
	(NULL,'谢依霖','女','img/13.jpg','1234567891234','香港大学','50'),
	(NULL,'张杰','男','img/14.jpg','1234567891234','哈弗大学','20'),
	(NULL,'文章','男','img/15.jpg','1234567891234','河北大学','10'),

	(NULL,'何洁','女','img/16.jpg','1234567891234','东北大学','20'),
	(NULL,'汪峰','男','img/17.jpg','1234567891234','哈尔滨大学','40'),
	(NULL,'薛之谦','男','img/18.jpg','1234567891234','哈尔滨师范大学','20'),
	(NULL,'周笔畅','女','img/19.jpg','1234567891234','哈尔滨工业大学','10'),
	(NULL,'李晨','男','img/20.jpg','1234567891234','内蒙古大学','50'),

	(NULL,'田馥甄','女','img/21.jpg','1234567891234','四川大学','30'),
	(NULL,'张国荣','男','img/22.jpg','1234567891234','哈尔滨大学','50'),
	(NULL,'本兮','女','img/23.jpg','1234567891234','香港大学','50'),
	(NULL,'何炅','男','img/24.jpg','1234567891234','北京邮电大学','30'),
	(NULL,'杜海涛','男','img/25.jpg','1234567891234','上海交通大学','10');
CREATE TABLE department(
	did INT PRIMARY KEY AUTO_INCREMENT,
	dname VARCHAR(256),
	count INT
);
INSERT INTO department VALUE
	('10','计算机系','7'),
	('20','数学系','5'),
	('30','外语系','4'),
	('40','生物系','3'),
	('50','音乐舞蹈系','6');
